name: "fraud_model"
backend: "onnxmlir"
max_batch_size: 0

input [
  {
    name: "input"
    data_type: TYPE_FP32
    dims: [1,9]
  }
]

output [
  {
    name: "output"
    data_type: TYPE_FP32
    dims: [1,1]
  }
]

instance_group [
  {
    kind: KIND_CPU
    count: 4
  }
]
