name: "fraud_ensemble"
platform: "ensemble"
max_batch_size: 0

input [
  {
    name: "raw_input"
    data_type: TYPE_FP32
    dims: [1,9]
  }
]

output [
  {
    name: "output"
    data_type: TYPE_FP32
    dims: [1,1]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "fraud_preprocessor"
      model_version: -1
      input_map {
        key: "raw_input"
        value: "raw_input"
      }
      output_map {
        key: "input"
        value: "input"
      }
    },
    {
      model_name: "fraud_model"
      model_version: -1
      input_map {
        key: "input"
        value: "input"
      }
      output_map {
        key: "output"
        value: "output"
      }
    }
  ]
}